УТ_для_edt/src/InformationRegisters/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияЛидов</types>
    </type>
  </resources>
  <resources>
    <name>СконвертированВОбъект</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанСКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтказаПоИнтересам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ЖурналДокументов/CRM_ЖурналДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЖурналДокументов</name>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ВходящееИсходящее</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСобытия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПрисоединенныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИнтерес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтересЯвляетсяОснованием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ГлавнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_Интерес</name>
    <comment>Интерес</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ОбъектыАРМ_Обращения/CRM_ОбъектыАРМ_Обращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОбъектыАРМ_Обращения</name>
  <resources>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СмещениеДатыЗаполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СмещениеДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Звонок_Состояние</name>
    <type>
      <types>EnumRef.сфпСостоянияЗвонков</types>
    </type>
  </resources>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.CRM_Обращения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ВидыКаналовПоступленияОбращений/CRM_ВидыКаналовПоступленияОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыКаналовПоступленияОбращений</name>
  <enumValues>
    <name>ЭлектроннаяПочта</name>
  </enumValues>
  <enumValues>
    <name>ТелефонныйЗвонок</name>
  </enumValues>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>Диалоги</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыСообщенияМессенджера/CRM_ВидыСообщенияМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыСообщенияМессенджера</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новое</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонено</description>
    </items>
    <items>
      <name>Повторный</name>
      <description>Повторное</description>
    </items>
    <items>
      <name>ПовторныйОбработанный</name>
      <description>Повторное (обработанное)</description>
    </items>
    <items>
      <name>Сконвертирован</name>
      <description>Сконвертировано</description>
    </items>
  </predefined>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/CRM_СостоянияЛидов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПереходНаНовуюВерсию

// Регистрирует на плане обмена ОбновлениеИнформационнойБазы объекты,
// для которых необходимо обновить записи в регистре.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_СостоянияЛидов.Лид КАК Лид
	|ИЗ
	|	РегистрСведений.CRM_СостоянияЛидов КАК CRM_СостоянияЛидов
	|ГДЕ
	|	НЕ CRM_СостоянияЛидов.СконвертированВОбъект = НЕОПРЕДЕЛЕНО";
	ИзмеренияРегистра = Запрос.Выполнить().Выгрузить();
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений.CRM_СостоянияЛидов";
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ИзмеренияРегистра, ДополнительныеПараметры);

КонецПроцедуры

// Обновить записи регистра.
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(
		Параметры.Очередь, "РегистрСведений.CRM_СостоянияЛидов");
	Пока Выборка.Следующий() Цикл
		Попытка
			НаборЗаписей = РегистрыСведений.CRM_СостоянияЛидов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Лид.Установить(Выборка.Лид);
			НаборЗаписей.Прочитать();
			Для Каждого СведенияОЛиде Из НаборЗаписей Цикл
				СконвертированВОбъект	= СведенияОЛиде.СконвертированВОбъект;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "Ответственный") Тогда
					Если ЗначениеЗаполнено(СконвертированВОбъект.Ответственный) Тогда
						Если ТипЗнч(СконвертированВОбъект.Ответственный) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
							СведенияОЛиде.ДатаОбработки = Дата('00010101');
						КонецЕсли;
					ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "CRM_РольОтветственного") Тогда
						Если ЗначениеЗаполнено(СконвертированВОбъект.CRM_РольОтветственного) Тогда
							СведенияОЛиде.ДатаОбработки = Дата('00010101');
						КонецЕсли;	
					КонецЕсли;
				ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "CRM_РольОтветственного") Тогда
					Если ЗначениеЗаполнено(СконвертированВОбъект.CRM_РольОтветственного) Тогда
						СведенияОЛиде.ДатаОбработки = Дата('00010101');
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			ОбъектовОбработано = ОбъектовОбработано + 1;
		Исключение
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось обработать Дату обработки обращения: %1 по причине:"
"%2'"), 
				Выборка.Лид, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Выборка.Ссылка.Метаданные(), Выборка.Лид, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	ОбработкаРегистраЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, "РегистрСведений.CRM_СостоянияЛидов");
	Параметры.ОбработкаЗавершена = ОбработкаРегистраЗавершена;
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Процедуре РегистрыСведений.CRM_СостоянияЛидов.ОбработатьДанныеДляПереходаНаНовуюВерсию не удалось обработать некоторые значения реквизита Дата обработки (пропущены): %1'"), 
			ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			РегистрыСведений.CRM_СостоянияЛидов,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Процедура РегистрыСведений.CRM_СостоянияЛидов.ОбработатьДанныеДляПереходаНаНовуюВерсию обработала очередную порцию значений реквизита Дата обработки: %1'"),
				ОбъектовОбработано));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьСостояниеЛида(Лид, Состояние = Неопределено, Знач СконвертированВОбъект = Неопределено, ПричинаОтклонения = Неопределено, Комментарий="", СвязанСКлиентом = Неопределено, ДанныеПовторногоОбращения = Неопределено) Экспорт
	
	Если Лид.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПовторногоОбращения) = Тип("Структура") Тогда
		
		Состояние = ДанныеПовторногоОбращения.Состояние;
		СконвертированВОбъект = ДанныеПовторногоОбращения.CRM_Интерес;
		
	Иначе
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	CRM_ЖурналДокументов.CRM_Интерес
		                      |ИЗ
		                      |	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
		                      |ГДЕ
		                      |	CRM_ЖурналДокументов.Объект = &Объект
		                      |	И CRM_ЖурналДокументов.CRM_Интерес <> ЗНАЧЕНИЕ(Документ.CRM_Интерес.ПустаяСсылка)");
		
		Запрос.УстановитьПараметр("Объект", Лид);
		Если НЕ Запрос.Выполнить().Пустой() И (Состояние = Неопределено ИЛИ Состояние = Справочники.CRM_СостоянияЛидов.Новый) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Лид) <> Тип("ДокументСсылка.CRM_Заявка") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
			|	CRM_СостоянияЛидов.Лид КАК Лид
			|ИЗ
			|	РегистрСведений.CRM_СостоянияЛидов КАК CRM_СостоянияЛидов
			|ГДЕ
			|	ИСТИНА И 
			|	CRM_СостоянияЛидов.Состояние = &Состояние");
		Запрос.УстановитьПараметр("Состояние", Справочники.CRM_СостоянияЛидов.Новый);
		Если ТипЗнч(Лид) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
			ТекстУсловия = "CRM_СостоянияЛидов.Лид.АбонентКакСвязаться = &АбонентКакСвязаться И ";
			Запрос.УстановитьПараметр("АбонентКакСвязаться", Лид.АбонентКакСвязаться);
		ИначеЕсли ТипЗнч(Лид) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
			ТекстУсловия = "CRM_СостоянияЛидов.Лид.ID_Пользователя = &ID_Пользователя И ";
			Запрос.УстановитьПараметр("ID_Пользователя", Лид.ID_Пользователя);
		ИначеЕсли ТипЗнч(Лид) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
			ТекстУсловия = "CRM_СостоянияЛидов.Лид В (&ЦепочкаПисем) И ";
			Запрос.УстановитьПараметр("ЦепочкаПисем", ПолучитьЦепочкуПисем(Лид));
		ИначеЕсли ТипЗнч(Лид) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
			ТекстУсловия = "CRM_СостоянияЛидов.Лид В (&ЦепочкаПисем) И ";
			Запрос.УстановитьПараметр("ЦепочкаПисем", ПолучитьЦепочкуПисем(Лид));
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА И", ТекстУсловия);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.CRM_СостоянияЛидов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Лид = Выборка.Лид;
			МенеджерЗаписи.Удалить();
		КонецЦикла;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.CRM_СостоянияЛидов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Лид = Лид;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Лид = Лид;
	Если СвязанСКлиентом <> Неопределено Тогда
		МенеджерЗаписи.СвязанСКлиентом = СвязанСКлиентом;
	КонецЕсли;
	Если ТипЗнч(Лид) = Тип("ДокументСсылка.CRM_Заявка") Тогда
		МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.Заявка;
		МенеджерЗаписи.КаналПолучения = Лид.ИсточникПолучения;
	ИначеЕсли ТипЗнч(Лид) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.ТелефонныйЗвонок;
	// +Рарус alexpr
	//ИначеЕсли ТипЗнч(Лид) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
	ИначеЕсли ТипЗнч(Лид) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Или ТипЗнч(Лид) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
	// -Рарус alexpr
		МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.Диалоги;
		МенеджерЗаписи.КаналПолучения = Лид.УчетнаяЗапись;
	ИначеЕсли ТипЗнч(Лид) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.ЭлектроннаяПочта;
		МенеджерЗаписи.КаналПолучения = Лид.УчетнаяЗапись;
	ИначеЕсли ТипЗнч(Лид) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		МенеджерЗаписи.ВидКанала = Перечисления.CRM_ВидыКаналовПоступленияОбращений.ЭлектроннаяПочта;
		МенеджерЗаписи.КаналПолучения = Лид.УчетнаяЗапись;
	КонецЕсли;
	
	ПредыдущееСостояние = МенеджерЗаписи.Состояние;
	
	МенеджерЗаписи.Состояние = ?(ЗначениеЗаполнено(Состояние), Состояние, Справочники.CRM_СостоянияЛидов.Новый);
	МенеджерЗаписи.ПричинаОтклонения = ПричинаОтклонения;
	
	ПредыдущееСконвертированВОбъект = МенеджерЗаписи.СконвертированВОбъект;
	
	МенеджерЗаписи.СконвертированВОбъект = СконвертированВОбъект;
	МенеджерЗаписи.Комментарий = Комментарий;
	
	Если МенеджерЗаписи.Состояние = Справочники.CRM_СостоянияЛидов.Новый
		ИЛИ МенеджерЗаписи.Состояние = Справочники.CRM_СостоянияЛидов.Повторный Тогда
		МенеджерЗаписи.ДатаОбработки = '00010101';
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Лид, "CRM_РольОтветственного")
			И НЕ ЗначениеЗаполнено(Лид.Ответственный) И ЗначениеЗаполнено(Лид.CRM_РольОтветственного) Тогда
			МенеджерЗаписи.ОтветственныйЗаОбработку = Лид.CRM_РольОтветственного;
		Иначе
			МенеджерЗаписи.ОтветственныйЗаОбработку = Лид.Ответственный;
		КонецЕсли;
	ИначеЕсли НЕ (МенеджерЗаписи.Состояние = ПредыдущееСостояние
		И МенеджерЗаписи.СконвертированВОбъект = ПредыдущееСконвертированВОбъект) Тогда
		МенеджерЗаписи.ДатаОбработки = ТекущаяДатаСеанса();
		МенеджерЗаписи.ОтветственныйЗаОбработку = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
	КонецЕсли;
	
	Если МенеджерЗаписи.Состояние = Справочники.CRM_СостоянияЛидов.Сконвертирован Тогда
		СконвертированВОбъект	= МенеджерЗаписи.СконвертированВОбъект;
		Если ЗначениеЗаполнено(СконвертированВОбъект) Тогда 
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "Ответственный") Тогда
				Если ЗначениеЗаполнено(СконвертированВОбъект.Ответственный) Тогда
					Если ТипЗнч(СконвертированВОбъект.Ответственный) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
						МенеджерЗаписи.ДатаОбработки 			= Дата('00010101');
						МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.Ответственный;
					КонецЕсли;	
				ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "CRM_РольОтветственного") Тогда
					Если ЗначениеЗаполнено(СконвертированВОбъект.CRM_РольОтветственного) Тогда
						МенеджерЗаписи.ДатаОбработки			= Дата('00010101');
						МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.CRM_РольОтветственного;
					КонецЕсли;
				Иначе
					МенеджерЗаписи.ДатаОбработки				= Дата('00010101');
					МенеджерЗаписи.ОтветственныйЗаОбработку		= Справочники.Пользователи.ПустаяСсылка();
				КонецЕсли;
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "CRM_РольОтветственного") Тогда
				Если ЗначениеЗаполнено(СконвертированВОбъект.CRM_РольОтветственного) Тогда
					МенеджерЗаписи.ДатаОбработки			= Дата('00010101');
					МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.CRM_РольОтветственного;
				КонецЕсли;
			Иначе
				МенеджерЗаписи.ДатаОбработки				= Дата('00010101');
				МенеджерЗаписи.ОтветственныйЗаОбработку		= Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли МенеджерЗаписи.Состояние = Справочники.CRM_СостоянияЛидов.ПовторныйОбработанный Тогда
		СконвертированВОбъект	= МенеджерЗаписи.СконвертированВОбъект;
		Если ЗначениеЗаполнено(СконвертированВОбъект) Тогда 
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "Ответственный") Тогда
				Если ЗначениеЗаполнено(СконвертированВОбъект.Ответственный) Тогда
					Если ТипЗнч(СконвертированВОбъект.Ответственный) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
						МенеджерЗаписи.ДатаОбработки 			= Дата('00010101');
						МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.Ответственный;
					КонецЕсли;	
				ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "CRM_РольОтветственного") Тогда
					Если ЗначениеЗаполнено(СконвертированВОбъект.CRM_РольОтветственного) Тогда
						МенеджерЗаписи.ДатаОбработки			= Дата('00010101');
						МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.CRM_РольОтветственного;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "CRM_РольОтветственного") Тогда
				Если ЗначениеЗаполнено(СконвертированВОбъект.CRM_РольОтветственного) Тогда
					МенеджерЗаписи.ДатаОбработки			= Дата('00010101');
					МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.CRM_РольОтветственного;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли МенеджерЗаписи.Состояние = Справочники.CRM_СостоянияЛидов.Новый Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Лид, "CRM_Предмет") Тогда
			ОснованиеОбъект	= Лид.CRM_Предмет;
			Если ЗначениеЗаполнено(ОснованиеОбъект) Тогда
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОснованиеОбъект, "Ответственный") И НЕ ЗначениеЗаполнено(ОснованиеОбъект.Ответственный) Тогда
					МенеджерЗаписи.ДатаОбработки = Дата('00010101');
					МенеджерЗаписи.ОтветственныйЗаОбработку = Справочники.Пользователи.ПустаяСсылка();
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Лид, "ВзаимодействиеОснование") Тогда
			ОснованиеОбъект	= Лид.ВзаимодействиеОснование;
			Если ЗначениеЗаполнено(ОснованиеОбъект) Тогда
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОснованиеОбъект, "Ответственный") И НЕ ЗначениеЗаполнено(ОснованиеОбъект.Ответственный) Тогда
					МенеджерЗаписи.ДатаОбработки = Дата('00010101');
					МенеджерЗаписи.ОтветственныйЗаОбработку = Справочники.Пользователи.ПустаяСсылка();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	МенеджерЗаписи.Описание = ОписаниеОбращения(Лид);
	МенеджерЗаписи.Записать();
	
	// +Рарус alexpr
	РегистрыСведений.CRM_ОбъектыАРМ_Обращения.ЗарегистрироватьЛидВАРМ(Лид, МенеджерЗаписи.Состояние);
	// -Рарус alexpr
	
КонецПроцедуры

Функция ПолучитьЦепочкуПисем(Письмо)
	ТекПисьмо = Письмо;
	СписокЦепочки = Новый СписокЗначений;
	Выборка = КритерииОтбора.СвязанныеДокументы.Найти(Письмо);
	Пока CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("ВзаимодействиеОснование", ТекПисьмо.Метаданные())
		И ЗначениеЗаполнено(ТекПисьмо.ВзаимодействиеОснование) И ТекПисьмо.ВзаимодействиеОснование<>ТекПисьмо Цикл
		Если СписокЦепочки.НайтиПоЗначению(ТекПисьмо.ВзаимодействиеОснование) = Неопределено Тогда
			СписокЦепочки.Добавить(ТекПисьмо.ВзаимодействиеОснование);
		Иначе
			Прервать;
		КонецЕсли;
		ТекПисьмо = ТекПисьмо.ВзаимодействиеОснование;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
	
	Запрос.УстановитьПараметр("ЗначениеКритерияОтбора",Письмо);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЦепочки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат СписокЦепочки;
КонецФункции

Процедура УдалитьСостояниеЛида(Лид) Экспорт
	НаборЗаписей = РегистрыСведений.CRM_СостоянияЛидов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лид.Установить(Лид);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество()>0 Тогда
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры
	
Функция СсылкаЯвляетсяЛидом(Ссылка, СУказаниемПричиныОтклонения = Ложь) Экспорт
	Если НЕ (Константы.CRM_ОтображатьВАРМИсходящиеПисьмаИЗвонки.Получить() = Истина) Тогда
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
			Возврат Ложь;
		ИначеЕсли (ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок")) И НЕ Ссылка.Входящий Тогда	
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;	
	ЭтоЛид = Ложь;
	Если Метаданные.РегистрыСведений.CRM_СостоянияЛидов.Измерения.Лид.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
		МетаданныеОбъекта = Ссылка.Метаданные();
		Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("УчетнаяЗапись", МетаданныеОбъекта) Тогда
			Если Ссылка.УчетнаяЗапись.CRM_ИсточникЛидов Тогда
				Если МетаданныеОбъекта.Имя = "CRM_СообщениеМессенджера" И Ссылка.ВидСообщения = Перечисления.CRM_ВидыСообщенияМессенджера.Исходящее Тогда
					ЭтоЛид = Ложь;
				Иначе	
					Если СУказаниемПричиныОтклонения Тогда
						ЭтоЛид = Ссылка.УчетнаяЗапись.CRM_ИсточникЛидов И Ссылка.УчетнаяЗапись.CRM_УказыватьПричинуОтклонения;
					Иначе	
						ЭтоЛид = Ссылка.УчетнаяЗапись.CRM_ИсточникЛидов;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
				Если СУказаниемПричиныОтклонения Тогда
					ЭтоЛид = Константы.CRM_ОбязательноУказыватьПричинуПотериЗвонков.Получить();
				Иначе
					ЭтоЛид = Истина;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Заявка") Тогда
				Если СУказаниемПричиныОтклонения Тогда
					ЭтоЛид = Ссылка.ИсточникПолучения.CRM_ИсточникЛидов И Ссылка.ИсточникПолучения.CRM_УказыватьПричинуОтклонения;
				Иначе	
					ЭтоЛид = Ссылка.ИсточникПолучения.CRM_ИсточникЛидов;
				КонецЕсли;
			Иначе	
				ЭтоЛид = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ЭтоЛид;
КонецФункции

Функция ЕстьЛидыВМассивеСсылок(МассивСсылок, СУказаниемПричиныОтклонения) Экспорт
	Для каждого Ссылка Из МассивСсылок Цикл
		Если СсылкаЯвляетсяЛидом(Ссылка, СУказаниемПричиныОтклонения) И ЭтоТекущийЛид(Ссылка) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция ЭтоТекущийЛид(Ссылка) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияЛидов.Состояние
	                      |ИЗ
	                      |	РегистрСведений.CRM_СостоянияЛидов КАК CRM_СостоянияЛидов
	                      |ГДЕ
	                      |	CRM_СостоянияЛидов.Лид = &Лид
	                      |	И CRM_СостоянияЛидов.Состояние В (&СостоянияТекущихЛидов)");
	Запрос.УстановитьПараметр("Лид", Ссылка);
	СостоянияТекущихЛидов = Новый СписокЗначений;
	СостоянияТекущихЛидов.Добавить(Справочники.CRM_СостоянияЛидов.Новый);
	Запрос.УстановитьПараметр("СостоянияТекущихЛидов", СостоянияТекущихЛидов);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПолучитьТекущееСостояниеЛида(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияЛидов.Состояние КАК Состояние,
	                      |	CRM_СостоянияЛидов.Комментарий КАК Комментарий,
	                      |	CRM_СостоянияЛидов.ПричинаОтклонения КАК ПричинаОтклонения,
						  |	CRM_СостоянияЛидов.ДатаОбработки КАК ДатаОбработки,
						  |	CRM_СостоянияЛидов.ОтветственныйЗаОбработку КАК ОтветственныйЗаОбработку,
	                      |	CRM_СостоянияЛидов.СконвертированВОбъект КАК СконвертированВОбъект
	                      |ИЗ
	                      |	РегистрСведений.CRM_СостоянияЛидов КАК CRM_СостоянияЛидов
	                      |ГДЕ
	                      |	CRM_СостоянияЛидов.Лид = &Лид");
	Запрос.УстановитьПараметр("Лид", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Состояние = Новый Структура;
		Состояние.Вставить("Состояние", Выборка.Состояние);
		Состояние.Вставить("СконвертированВОбъект", Выборка.СконвертированВОбъект);
		Состояние.Вставить("Комментарий", Выборка.Комментарий);
		Состояние.Вставить("ПричинаОтклонения", Выборка.ПричинаОтклонения);
		Состояние.Вставить("ДатаОбработки", Выборка.ДатаОбработки);
		Состояние.Вставить("ОтветственныйЗаОбработку", Выборка.ОтветственныйЗаОбработку);
		Возврат Состояние;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьТекущееСостояниеЛидов(МассивСсылок) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияЛидов.Лид КАК Лид,
	                      |	CRM_СостоянияЛидов.Состояние КАК Состояние,
	                      |	CRM_СостоянияЛидов.Комментарий КАК Комментарий,
	                      |	CRM_СостоянияЛидов.ПричинаОтклонения КАК ПричинаОтклонения,
						  |	CRM_СостоянияЛидов.ДатаОбработки КАК ДатаОбработки,
						  |	CRM_СостоянияЛидов.ОтветственныйЗаОбработку КАК ОтветственныйЗаОбработку,
	                      |	CRM_СостоянияЛидов.СконвертированВОбъект КАК СконвертированВОбъект
	                      |ИЗ
	                      |	РегистрСведений.CRM_СостоянияЛидов КАК CRM_СостоянияЛидов
	                      |ГДЕ
	                      |	CRM_СостоянияЛидов.Лид В(&МассивЛидов)");
	Запрос.УстановитьПараметр("МассивЛидов", МассивСсылок);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ЗаписатьВспомогательныеДанныеОбращения(Обращение, СвязанСКлиентом = Неопределено) Экспорт

	МенеджерЗаписи = РегистрыСведений.CRM_СостоянияЛидов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Лид = Обращение;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Лид = Обращение;
	МенеджерЗаписи.Описание = ОписаниеОбращения(Обращение);
	
	Если СвязанСКлиентом <> Неопределено Тогда
		МенеджерЗаписи.СвязанСКлиентом = СвязанСКлиентом;
	КонецЕсли;
	
	Если МенеджерЗаписи.Состояние = Справочники.CRM_СостоянияЛидов.Новый
		ИЛИ МенеджерЗаписи.Состояние = Справочники.CRM_СостоянияЛидов.Повторный Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "CRM_РольОтветственного")
			И НЕ ЗначениеЗаполнено(Обращение.Ответственный) И ЗначениеЗаполнено(Обращение.CRM_РольОтветственного) Тогда
			МенеджерЗаписи.ОтветственныйЗаОбработку = Обращение.CRM_РольОтветственного;
		Иначе
			МенеджерЗаписи.ОтветственныйЗаОбработку = Обращение.Ответственный;
		КонецЕсли;
	КонецЕсли;
	
	Если МенеджерЗаписи.Состояние = Справочники.CRM_СостоянияЛидов.Сконвертирован Тогда
		СконвертированВОбъект	= МенеджерЗаписи.СконвертированВОбъект;
		Если ЗначениеЗаполнено(СконвертированВОбъект) Тогда 
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "Ответственный") Тогда
				Если ЗначениеЗаполнено(СконвертированВОбъект.Ответственный) Тогда
					Если ТипЗнч(СконвертированВОбъект.Ответственный) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
						МенеджерЗаписи.ДатаОбработки 			= Дата('00010101');
						МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.Ответственный;
					КонецЕсли;	
				ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "CRM_РольОтветственного") Тогда
					Если ЗначениеЗаполнено(СконвертированВОбъект.CRM_РольОтветственного) Тогда
						МенеджерЗаписи.ДатаОбработки			= Дата('00010101');
						МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.CRM_РольОтветственного;
					КонецЕсли;
				Иначе
					МенеджерЗаписи.ДатаОбработки				= Дата('00010101');
					МенеджерЗаписи.ОтветственныйЗаОбработку		= Справочники.Пользователи.ПустаяСсылка();
				КонецЕсли;
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "CRM_РольОтветственного") Тогда
				Если ЗначениеЗаполнено(СконвертированВОбъект.CRM_РольОтветственного) Тогда
					МенеджерЗаписи.ДатаОбработки			= Дата('00010101');
					МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.CRM_РольОтветственного;
				КонецЕсли;
			Иначе
				МенеджерЗаписи.ДатаОбработки				= Дата('00010101');
				МенеджерЗаписи.ОтветственныйЗаОбработку		= Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли МенеджерЗаписи.Состояние = Справочники.CRM_СостоянияЛидов.Новый Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "CRM_Предмет") Тогда
			ОснованиеОбъект	= Обращение.CRM_Предмет;
			Если ЗначениеЗаполнено(ОснованиеОбъект) Тогда
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОснованиеОбъект, "Ответственный") И НЕ ЗначениеЗаполнено(ОснованиеОбъект.Ответственный) Тогда
					МенеджерЗаписи.ДатаОбработки = Дата('00010101');
					МенеджерЗаписи.ОтветственныйЗаОбработку = Справочники.Пользователи.ПустаяСсылка();
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Обращение, "ВзаимодействиеОснование") Тогда
			ОснованиеОбъект	= Обращение.ВзаимодействиеОснование;
			Если ЗначениеЗаполнено(ОснованиеОбъект) Тогда
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОснованиеОбъект, "Ответственный") И НЕ ЗначениеЗаполнено(ОснованиеОбъект.Ответственный) Тогда
					МенеджерЗаписи.ДатаОбработки = Дата('00010101');
					МенеджерЗаписи.ОтветственныйЗаОбработку = Справочники.Пользователи.ПустаяСсылка();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
	// +Рарус alexpr
	РегистрыСведений.CRM_ОбъектыАРМ_Обращения.ЗарегистрироватьЛидВАРМ(Обращение, МенеджерЗаписи.Состояние);
	// -Рарус alexpr
	
КонецПроцедуры

Процедура ОбновитьПоСконвертированВОбъект(СконвертированВОбъект) Экспорт
	Если НЕ ЗначениеЗаполнено(СконвертированВОбъект) Тогда
		Возврат;
	ИначеЕсли НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СконвертированВОбъект, "Ответственный") Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(СконвертированВОбъект.Ответственный) Тогда
		Возврат;
	ИначеЕсли НЕ (ТипЗнч(СконвертированВОбъект.Ответственный) = Тип("СправочникСсылка.Пользователи")) Тогда
		Возврат;
	КонецЕсли;	
	Запрос	= Новый Запрос;
	Запрос.УстановитьПараметр("СконвертированВОбъект", СконвертированВОбъект);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	CRM_СостоянияЛидов.Лид КАК Лид
	               |ИЗ
	               |	РегистрСведений.CRM_СостоянияЛидов КАК CRM_СостоянияЛидов
	               |ГДЕ
	               |	CRM_СостоянияЛидов.СконвертированВОбъект = &СконвертированВОбъект";
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи		= РегистрыСведений.CRM_СостоянияЛидов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Лид	= Выборка.Лид;
		МенеджерЗаписи.Прочитать();
		Если ЗначениеЗаполнено(МенеджерЗаписи.ОтветственныйЗаОбработку) 
			И (ТипЗнч(МенеджерЗаписи.ОтветственныйЗаОбработку) = Тип("СправочникСсылка.Пользователи")) Тогда
			Продолжить;
		КонецЕсли;	
		МенеджерЗаписи.ДатаОбработки			= ТекущаяДатаСеанса();
		МенеджерЗаписи.ОтветственныйЗаОбработку	= СконвертированВОбъект.Ответственный; 
		МенеджерЗаписи.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает значение реквизита, используемое при поиске в АРМ
Функция ОписаниеОбращения(Обращение)
	
	ТекстОписания = "";
	
	Если Не ЗначениеЗаполнено(Обращение) Тогда
		Возврат ТекстОписания;
	КонецЕсли;
	
	Контакт = "";
	КонтактАдрес = "";
	КонтактТелефон = "";
	// +Рарус alexpr
	//тКрайнийСрок = Формат(Обращение.Дата, "ДФ='d MMM'");
	Если ТипЗнч(Обращение) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
		тКрайнийСрок = Формат(Обращение.ДатаНачала, "ДФ='d MMM'");
	Иначе
		тКрайнийСрок = Формат(Обращение.Дата, "ДФ='d MMM'");
	КонецЕсли;
	// -Рарус alexpr

	Если ТипЗнч(Обращение) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Контакт = Обращение.ОтправительКонтакт;
		КонтактАдрес = Обращение.ОтправительАдрес;
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_Заявка") Тогда
		Контакт = Обращение.Наименование;
		КонтактАдрес = Обращение.ЭлектроннаяПочта;
		КонтактТелефон = Обращение.Телефон;
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Контакт = Обращение.АбонентКонтакт;
		КонтактАдрес = Обращение.АбонентКакСвязаться;
	// +Рарус alexpr
	//ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
	ИначеЕсли ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") 
				Или ТипЗнч(Обращение) = Тип("СправочникСсылка.CRM_Диалоги") Тогда
	// -Рарус alexpr
		Контакт = Обращение.Контакт;
		КонтактАдрес = Обращение.КонтактПредставление;
	КонецЕсли;

	Если ТипЗнч(Обращение) = Тип("ДокументСсылка.CRM_Заявка") Тогда
		ТекстОписания = тКрайнийСрок + " | " + Строка(?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "")) + ?(ЗначениеЗаполнено(КонтактТелефон), " <" + КонтактТелефон + ">", "") + ?(ЗначениеЗаполнено(КонтактАдрес), " <" + КонтактАдрес + ">", "");
	Иначе			
		ТекстОписания = тКрайнийСрок + " | " + Строка(?(ЗначениеЗаполнено(Контакт), Строка(Контакт) + " <" + КонтактАдрес + ">", КонтактАдрес));
	КонецЕсли;
	
	Возврат ТекстОписания;
	
КонецФункции

#КонецОбласти

#КонецЕсли
